In [2]:
import pandas as pd

data = {'Имя': ['Анна', 'Иван', 'Петр'],
        'Возраст': [25, 30, 28],
        'Город': ['Москва', 'Санкт-Петербург', 'Казань']}
df = pd.DataFrame(data, index=['A', 'B', 'C'])

In [3]:
print(df)

    Имя  Возраст            Город
A  Анна       25           Москва
B  Иван       30  Санкт-Петербург
C  Петр       28           Казань

In [4]:
# Выбор всех значений столбца 'Имя'
print(df['Имя'])

A    Анна
B    Иван
C    Петр
Name: Имя, dtype: object

In [5]:
# Выбор строк с 1 по 2 (не включая 2)
print(df[1:2])

    Имя  Возраст            Город
B  Иван       30  Санкт-Петербург

In [6]:
print(df)

    Имя  Возраст            Город
A  Анна       25           Москва
B  Иван       30  Санкт-Петербург
C  Петр       28           Казань

In [7]:
df.loc['B', 'Город']  # Вывод: 'Санкт-Петербург'

'Санкт-Петербург'

In [8]:
df.loc['A']  # Вывод: данные строки 'A'

Имя          Анна
Возраст        25
Город      Москва
Name: A, dtype: object

In [9]:
df.loc[:, 'Возраст']  # Вывод: данные столбца 'Возраст'

A    25
B    30
C    28
Name: Возраст, dtype: int64

In [10]:
df.loc['B':'C', 'Возраст':'Город']  # Вывод: срез данных

   Возраст            Город
B       30  Санкт-Петербург
C       28           Казань

In [11]:
df.loc[['A', 'C'], ['Имя', 'Город']]  # Вывод: выбранные строки и столбцы

    Имя   Город
A  Анна  Москва
C  Петр  Казань

In [12]:
print(df)

    Имя  Возраст            Город
A  Анна       25           Москва
B  Иван       30  Санкт-Петербург
C  Петр       28           Казань

In [13]:
df.iloc[1, 2]  # Вывод: 'Санкт-Петербург'

'Санкт-Петербург'

In [14]:
df.iloc[0]  # Вывод: данные первой строки

Имя          Анна
Возраст        25
Город      Москва
Name: A, dtype: object

In [16]:
df.iloc[:, 1]  # Вывод: данные второго столбца

A    25
B    30
C    28
Name: Возраст, dtype: int64

In [17]:
df.iloc[1:3, 0:2]  # Вывод: выбраннй срез

    Имя  Возраст
B  Иван       30
C  Петр       28

In [19]:
df.iloc[[0, 2], [0, 2]]  # Вывод: выбранные строки и столбцы

    Имя   Город
A  Анна  Москва
C  Петр  Казань

In [1]:
import pandas as pd

data = {'name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'], 
        'age': [25, 30, 22, 35, 28], 
        'city': ['New York', 'London', 'Paris', 'London', 'Paris']}
df = pd.DataFrame(data)

In [2]:
print(df)

      name  age      city
0    Alice   25  New York
1      Bob   30    London
2  Charlie   22     Paris
3    David   35    London
4      Eve   28     Paris

In [3]:
# Выбрать строки, где возраст больше 25
df[df['age'] > 25]

    name  age    city
1    Bob   30  London
3  David   35  London
4    Eve   28   Paris

In [4]:
# Выбрать строки, где город - Paris и возраст больше 25
df.query('city == "Paris" and age > 25')

  name  age   city
4  Eve   28  Paris

In [5]:
# Выбрать строки, где город - Paris или London
cities = ['Paris', 'London']
df[df['city'].isin(cities)]

      name  age    city
1      Bob   30  London
2  Charlie   22   Paris
3    David   35  London
4      Eve   28   Paris

In [8]:
print(df)

      name  age      city
0    Alice   25  New York
1      Bob   30    London
2  Charlie   22     Paris
3    David   35    London
4      Eve   28     Paris

In [6]:
# Сортировка по возрасту по возрастанию (по умолчанию)
print(df.sort_values(by='age'))

      name  age      city
2  Charlie   22     Paris
0    Alice   25  New York
4      Eve   28     Paris
1      Bob   30    London
3    David   35    London

In [7]:
# Сортировка по городу по убыванию, затем по возрасту по возрастанию
print(df.sort_values(by=['city', 'age'], ascending=[False, True]))

      name  age      city
2  Charlie   22     Paris
4      Eve   28     Paris
0    Alice   25  New York
1      Bob   30    London
3    David   35    London

In [9]:
print(df)

      name  age      city
0    Alice   25  New York
1      Bob   30    London
2  Charlie   22     Paris
3    David   35    London
4      Eve   28     Paris

In [10]:
# Выбрать строки, где город - London, отсортировать по возрасту по убыванию
print(df[df['city'] == 'London'].sort_values(by='age', ascending=False))

    name  age    city
3  David   35  London
1    Bob   30  London